# Core
brew "git"
brew "zsh"
brew "dotbot"
brew "node" # Claude Code hooks (caveman) and npx-based MCP servers
tap "domt4/autoupdate"

# Shell utilities
brew "eza"
brew "fzf"
brew "fd"
brew "bat"
brew "ripgrep"
brew "jq"
brew "wget"
brew "htop"
brew "btop"
brew "duf"
brew "dust"
brew "shellcheck"
brew "fastfetch"
brew "flavours"
brew "rtk"
brew "coreutils"
brew "imagemagick"

# Git
brew "lazygit"
brew "diff-so-fancy", args: ["HEAD"]
brew "gnupg"

# Version manager
brew "asdf"

# Containers
brew "docker-compose"

brew "cloudflare-speed-cli"

# Terminal & multiplexer
brew "tmux"
cask "kitty"

# Music
brew "nowplaying-cli"

# Sketchybar + borders
tap "felixkratz/formulae"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/borders"
cask "font-sketchybar-app-font"
cask "font-hack-nerd-font"
cask "sf-symbols"

# Window manager
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"

# Security
cask "lulu"

# Apps
cask "claude-code"
cask "spotify"
cask "bitwarden"
cask "brave-browser"
cask "bruno"
cask "intellij-idea-ce"
cask "obsidian"
