# Core
brew "git"
brew "zsh"
brew "dotbot"
tap "domt4/autoupdate"

# Shell utilities
brew "eza"
brew "fzf"
brew "fd"
brew "bat"
brew "ripgrep"
brew "jq"
brew "wget"
brew "htop"
brew "fastfetch"
brew "rtk"

# Git
brew "lazygit"
brew "diff-so-fancy", args: ["HEAD"]

# Version manager
brew "asdf"

# Java / Kotlin
brew "openjdk"
brew "gradle"

# Go
brew "go"

# Containers
brew "docker-compose"

# Terminal & multiplexer
brew "tmux"
cask "kitty"

# Music
brew "mpc"
brew "nowplaying-cli"

# Sketchybar
tap "felixkratz/formulae"
brew "felixkratz/formulae/sketchybar"
cask "font-sketchybar-app-font"
cask "sf-symbols"

# Window manager
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"

# Apps
cask "claude"
cask "spotify"
cask "bitwarden"
cask "brave-browser"
cask "bruno"
